var qidx = -1;

jQuery(document).ready(function($) {

var gtimesec = 30;

var newClock = function(timesec) {
gtimesec = timesec;
return jQuery('.clock').FlipClock(timesec, {
countdown: true,
clockFace: 'MinuteCounter',
autoStart: false,
language: "greek",
callbacks: {
interval: function() {
var time = clock.getTime().time;
if (time == 0) {
console.log('done...');
$('#endoftimedlg').modal('show');
}
}
}
})

};
var clock = newClock(gtimesec); // jQuery('.clock').FlipClock(120, {

$('#endoftimedlg').on('hidden.bs.modal', function() {
clock = newClock(gtimesec);
})

$("#inc1").click(function() {
v = parseInt($("#score1").val());
v += 1;
$("#score1").val(v);
});

$("#dec1").click(function() {
v = parseInt($("#score1").val());
v -= 1;
if (v >= 0) {
$("#score1").val(v);
}
});

$("#inc2").click(function() {
v = parseInt($("#score2").val());
v += 1;
$("#score2").val(v);
});

$("#dec2").click(function() {
v = parseInt($("#score2").val());
v -= 1;
if (v >= 0) {
$("#score2").val(v);
}
});

$("#starttimer").click(function() {
clock.start();
});

$("#stoptimer").click(function() {
clock.stop();
});


$("#reset30sec").click(function() {
// var clock = jQuery(".clock");
clock = newClock(30);
});

$("#reset3min").click(function() {
// var clock = jQuery(".clock");
clock = newClock(180);
});
});

function getQ() {
var q = '[\
{"question":"Πότε ξεκίνησε ο όρος νανοτεχνολογία;",\
"a1":"1. 440 π.Χ.",\
"a2":"2. 1851",\
"a3":"3. 1974",\
"a4":"4. 2016",\
"true":"3. 1974",\
"img":"media/img/norio-taniguchi.jpeg"},\
\
{"question":"Νανοτεχνολογία είναι το σύνολο των μεθόδων και των τεχνικών που έχουν αναπτυχθεί σε διαφορετικές επιστήμες και ασχολούνται με τις ιδιότητες της ύλης και την κατασκευή δομών σε διαστάσεις από 1 nm έως 100 nm",\
"a1":"1. Σωστό",\
"a2":"2. Λάθος",\
"true":"1. Σωστό",\
"img":"media/img/empty.png"},\
\
{"question":"Με τι ισούται το 1 νανόμετρο (nm);",\
"a1":"1. 1 δισεκατομμυριοστό του μέτρου",\
"a2":"2. 1 εκατομμυριοστό του μέτρου",\
"a3":"3. 1 χιλιοστό του μέτρου",\
"a4":"4. Δεν υπάρχει νανόμετρο",\
"true":"1. 1 δισεκατομμυριοστό του μέτρου",\
"img":"media/img/xarakas.png"},\
\
{"question":"Πώς μπορούμε να «δούμε» και να μετρήσουμε τις νανοδομές;",\
"a1":"1. Με μεγεθυντικό φακό",\
"a2":"2. Με οπτικό μικροσκόπιο",\
"a3": "3. Με ηλεκτρονικό μικροσκόπιο",\
"a4":"4. Δεν μπορούμε",\
"true":"3. Με ηλεκτρονικό μικροσκόπιο",\
"img":"media/img/microscope.jpg"},\
\
{"question":"Πότε ιδρύθηκε το Ινστιτούτο Νανοεπιστήμης και Νανοτεχνολογίας του ΕΚΕΦΕ Δημόκριτος;",\
"a1":"1. 1976",\
"a2":"2. 1983",\
"a3": "3. 2012",\
"a4":"4. 2019",\
"true":"3. 2012",\
"img":"media/img/inn.png"},\
\
{"question":"Γιατί να ασχολούμαστε με τη Νανοτεχνολογία;",\
"a1":"1. Για ελαχιστοποίηση ενέργειας και ποσότητας υλικών",\
"a2":"2. Για μικρότερο κόστος, καλύτερης φορητότητας και απόδοσης",\
"a3": "3. Για τη μείωση των αποβλήτων και την εκπομπή ρύπων",\
"a4":"4. Για όλα τα παραπάνω",\
"true":"4. Για όλα τα παραπάνω",\
"img":"media/img/empty.png"},\
\
{"question":"Που δεν μπορούμε να βρούμε λειτουργικές νανοδομές στη φύση;",\
"a1":"1. Σε πατούσες σαμιαμιδίων",\
"a2":"2. Σε μύδια",\
"a3": "3. Σε ορισμένες επιφάνειες φύλλων φυτών",\
"a4":"4. Σε διαμάντια δακτυλιδιών",\
"true":"4. Σε διαμάντια δακτυλιδιών",\
"img":"media/img/empty.png"},\
\
{"question":"Ο τρόπος αυτοκαθαρισμού των φύλλων οδήγησε τη νανοτεχνολογία να εφεύρει:",\
"a1":"1. Απορρυπαντικά",\
"a2":"2. Αυτοκαθαριζόμενα χρώματα επικάλυψης προσόψεων",\
"a3": "3. Σαπούνια",\
"a4":"4. Φωτοβολταϊκά",\
"true":"2. Αυτοκαθαριζόμενα χρώματα επικάλυψης προσόψεων",\
"img":"media/img/autocleaning2.jpg"},\
\
{"question":"Ποιες επιστημονικές μέθοδοι χρησιμοποιούνται στην σύγχρονη έρευνα;",\
"a1":"1. Θεωρία",\
"a2":"2. Θεωρία – Πείραμα",\
"a3": "3. Θεωρία – Πείραμα – Υπολογιστικές μέθοδοι",\
"a4":"4. Θεωρία – Πείραμα – Αστρολογία",\
"true":"3. Θεωρία – Πείραμα – Υπολογιστικές μέθοδοι",\
"img":"media/img/empty.png"},\
\
{"question":"Τι είναι οι υπολογιστικές μέθοδοι μοριακής προσομοίωσης;",\
"a1":"1. Σύνολο τεχνικών που εξετάζει τις ιδιότητες των υλικών με την βοήθεια Η/Υ",\
"a2":"2. Τεχνική για συνταγές μοριακής κουζίνας",\
"a3": "3. Μέθοδοι που αναλύουν την λειτουργία των οργάνων του ανθρώπινου σώματος με την βοήθεια Η/Υ",\
"a4":"4. Μέθοδοι για παραγωγή 3D παιχνιδιών ",\
"true":"1. Σύνολο τεχνικών που εξετάζει τις ιδιότητες των υλικών με την βοήθεια Η/Υ",\
"img":"media/vid/video-water.gif"},\
\
{"question":"Πού δεν βρίσκονται μαγνητικά υλικά στη φύση;",\
"a1":"1. Στον πυρήνα της Γης",\
"a2":"2. Στο αίμα του ανθρώπου ",\
"a3": "3. Στα κλαδιά των δέντρων",\
"a4":"4. Στους εγκεφάλους πτηνών",\
"true":"3. Στα κλαδιά των δέντρων",\
"img":"media/img/empty.png"},\
\
{"question":"Ποια υλικά έχουν μαγνητικές ιδιότητες;",\
"a1":"1. Σίδηρος",\
"a2":"2. Νικέλιο",\
"a3": "3. Ξύλο",\
"a4":"4. Κοβάλτιο",\
"true":"3. Ξύλο",\
"img":"media/img/magnet2.jpg"},\
\
{"question":"Πού χρησιμοποιούνται τα μαγνητικά νανοσωματίδια;",\
"a1":"1. Σε σκληρούς δίσκους και ηχεία υπολογιστών",\
"a2":"2. Στην ιατρική για διάγνωση και θεραπεία όγκων και καρδιοπαθειών",\
"a3": "3. Στον καθαρισμό υγρών από ανεπιθύμητα υλικά",\
"a4":"4. Σε όλα τα παραπάνω",\
"true":"4. Σε όλα τα παραπάνω",\
"img":"media/img/empty.png"},\
\
{"question":"Πώς μπορούμε να κάνουμε διάγνωση σε όγκους με τη νανοτεχνολογία;",\
"a1":"1. Με νανορομπότ που καταπίνουμε με τη βοήθεια νερού",\
"a2":"2. Με  νανοσωματίδια του οξειδίου του σιδήρου που συσσορεύονται γύρω στους όγκους και ανιχνεύονται από τον μαγνητικό τομογράφο",\
"a3": "3. Με νανοραντάρ που βρίσκονται στα νοσοκομεία",\
"a4":"4. Με νανοντετέκτιβ που ειδικεύονται στην επίλυση αστυνομικών υποθέσεων",\
"true":"2. Με  νανοσωματίδια του οξειδίου του σιδήρου που συσσορεύονται γύρω στους όγκους και ανιχνεύονται από τον μαγνητικό τομογράφο",\
"img":"media/img/empty.png"},\
\
{"question":"Ποια από τα παρακάτω είναι πορώδη;",\
"a1":"1. Ελαφρόπετρα, Σφουγγάρι και Τούβλο",\
"a2":"2. Χρυσά, Ασημένια και Χάλκινα κοσμήματα",\
"a3": "3. Τσάι, Χυμοί και Αναψυκτικά",\
"a4":"4. Όλα τα παραπάνω",\
"true":"1. Ελαφρόπετρα, Σφουγγάρι και Τούβλο",\
"img":"media/img/empty.png"},\
\
{"question":"Γιατί παρέχουμε νανοπορώδη υλικά με φάρμακο στους ασθενείς;",\
"a1":"1. Για να είναι προστατευμένο το φάρμακο",\
"a2":"2. Για να χωράει περισσότερο και να ελέγχεται η δόση του",\
"a3": "3. Γιατί δεν επιβαρύνει τον οργανισμό",\
"a4":"4. Σε όλα τα παραπάνω",\
"true":"4. Σε όλα τα παραπάνω",\
"img":"media/img/empty.png"},\
\
{"question":"Το εμβαδόν της επιφάνειας ενός γραμμαρίου νανοπορώδους υλικού NU-110 ισούται περίπου με:",\
"a1":"1. 1 τραπέζι επιτραπέζιας αντισφαίρισης",\
"a2":"2. 1 γήπεδο μπάσκετ",\
"a3": "3. 1 γήπεδο ποδοσφαίρου",\
"a4":"4. Με το ΕΚΕΦΕ Δημόκριτος",\
"true":"3. 1 γήπεδο ποδοσφαίρου",\
"img":"media/img/empty.png"},\
\
{"question":"Ένας Γάλλος χημικός, ήπιε στρυχνίνη 10 φορές πάνω από το όριο της θανατηφόρας δόσης αλλά δεν έπαθε απολύτως τίποτα. Είχε καταπιεί προηγουμένως περίπου 15 γραμμάρια ενεργού άνθρακα. Γιατί επέζησε;",\
"a1":"1. Ο άνθρακας ήταν αναμεμειγμένος με αντίδοτο της στρυχνίνης",\
"a2":"2. Ο άνθρακας θωράκισε τα τοιχώματα του στομάχου και η στρυχνίνη δεν πέρασε στο αίμα",\
"a3": "3. Ο άνθρακας μπορεί να προσροφήσει επιλεκτικά μεγάλες ποσότητες τοξινών-δηλητηρίων",\
"a4":"4. Απεβίωσε μετά από 1 μήνα",\
"true":"3. Ο άνθρακας μπορεί να προσροφήσει επιλεκτικά μεγάλες ποσότητες τοξινών-δηλητηρίων",\
"img":"media/img/empty.png"},\
\
{"question":"Ο ενεργός άνθρακας είναι ένα πολύ γνωστό νανοπορώδες υλικό. Μας βοηθά να απόμακρύνουμε διάφορες τοξικές ουσίες:",\
"a1":"1. Από το νερό και τον αέρα",\
"a2":"2. Από τον εγκέφαλο",\
"a3": "3. Από τα ρούχα",\
"a4":"4. Από τα πιάτα και τα ποτήρια",\
"true":"1. Από το νερό και τον αέρα",\
"img":"media/img/energos_anthrakas.jpeg"},\
\
{"question":"Το γραφένιο παράχθηκε το 2004 και είναι το πιο λεπτό και ισχυρό νανοϋλικό με πάχος 0.34nm. Ποιες ιδιότητες έχει;",\
"a1":"1. 100 φορές πιο ανθεκτικό από το ατσάλι αλλά και πολύ εύκαμπτο",\
"a2":"2. 100.000 φορές πιο ελαφρύ από το κανονικό χαρτί",\
"a3": "3. Εξαιρετικά αγώγιμο αφού τα ηλεκτρόνια κινούνται σε αυτό με 1000 km/sec",\
"a4":"4. Όλα τα παραπάνω",\
"true":"4. Όλα τα παραπάνω",\
"img":"media/img/grafenio.png"},\
\
{"question":"Πώς η νανοτεχνολογία βελτιώνει τα φωτοβολταικά;",\
"a1":"1. Αυξάνει την ποσότητα του ήλιου στο περιβάλλον κατά 20%",\
"a2":"2. Πολλαπλασιάζει τον αριθμό των κυψελών τους άρα και τα φωτόνια που απορροφούν",\
"a3": "3. Τα κάνει πιο εμφανίσιμα και πιο οικονομικά",\
"a4":"4. Όλα τα παραπάνω",\
"true":"2. Πολλαπλασιάζει τον αριθμό των κυψελών τους άρα και τα φωτόνια που απορροφούν",\
"img":"media/img/solar_panda.jpg"},\
\
{"question":"Το ΙΝΝ μελετά και αναπτύσσει φωτοβολταϊκά 3<sup>ης</sup> γενιάς. Σε τι διαφέρουν από αυτά που ήδη γνωρίζουμε; ",\
"a1":"1. Έχουν μικρότερο κόστος παραγωγής και μέγεθος",\
"a2":"2. Δεν έχουν μόνο μαύρο χρώμα και ενσωματώνονται σε κτήρια",\
"a3": "3. Λειτουργούν σε υψηλή απόδοση ανεξάρτητα από την ποσότητα ακτινοβολίας και την κλίση τους",\
"a4":"4. Όλα τα παραπάνω",\
"true":"4. Όλα τα παραπάνω",\
"img":"media/img/empty.png"},\
\
{"question":"Τι είναι ένα Πολυμερές;",\
"a1":"1. Ένα μεγάλο μόριο που αποτελείται από επαναλαμβανόμενες δομικές μονάδες μικρών μορίων που ονομάζονται μονομερή",\
"a2":"2. Ενα μεγάλο  μόριο που αποτελείται από τουλάχιστον είκοσι άτομα",\
"a3": "3. Ένα μεγάλο μόριο στο σχήμα του γράμματος «Π»",\
"a4":"4. Ένα μόριο που δεν είναι ευθύγραμμο",\
"true":"1. Ένα μεγάλο μόριο που αποτελείται από επαναλαμβανόμενες δομικές μονάδες μικρών μορίων που ονομάζονται μονομερή",\
"img":"media/img/empty.png"},\
\
{"question":"Υπάρχουν φυσικά και συνθετικά (φτιαγμένα από τον άνθρωπο) πολυμερή. Ποιο από τα παρακάτω ΔΕΝ είναι φυσικό πολυμερές;",\
"a1":"1. DNA",\
"a2":"2. Πρωτεΐνη",\
"a3": "3. Πλαστικό",\
"a4":"4. Κυτταρίνη",\
"true":"3. Πλαστικό",\
"img":"media/img/empty.png"},\
\
{"question":"Ποιες από τις παρακάτω είναι πρακτικές εφαρμογές διαχωρισμού μιγμάτων με μεμβράνες πολυμερών;",\
"a1":"1. Εμπλουτισμός του αέρα σε οξυγόνο για ιατρικούς σκοπούς",\
"a2":"2. Αφαλάτωση του θαλασσινού νερού ",\
"a3": "3. Aιμοκάθαρση",\
"a4":"4. Όλα τα παραπάνω ",\
"true":"4. Όλα τα παραπάνω ",\
"img":"media/img/empty.png"},\
\
{"question":"Η Ομήρου Οδύσσεια είναι 303 σελίδες Α4. Γραμμένη με ηλεκτρόνια στο ΙΝΝ, τι διαστάσεις έχει;",\
"a1":"1. 0.5 cm<sup>2</sup>",\
"a2":"2. 5 μm<sup>2</sup>",\
"a3": "3. 0.05 μm<sup>2</sup>",\
"a4":"4. 5 nm<sup>2</sup>",\
"true":"3. 0.05 μm<sup>2</sup>",\
"img":"media/img/odyssey.png"},\
\
{"question":"Για ποιο λόγο το κράτος της Σ. Αραβίας βράβευσε το ΙΝΝ του ΕΚΕΦΕ Δημόκριτος;",\
"a1":"1. Ο πρόεδρος του Δημόκριτου είναι Σαουδάραβας",\
"a2":"2. Για την καινοτόμο έρευνα  στον καθαρισμό του νερού μέσω φιλτραρίσματος και φωτοκατάλυσης",\
"a3": "3. Οι Σαουδάραβες είναι φιλέλληνες",\
"a4":"4. Για την καινοτόμο έρευνα στην εξόρυξη πετρελαίου σε μεγαλύτερο βάθος από τα σημερινά δεδομένα και με μικρότερο κόστος",\
"true":"2. Για την καινοτόμο έρευνα  στον καθαρισμό του νερού μέσω φιλτραρίσματος και φωτοκατάλυσης",\
"img":"media/img/empty.png"},\
\
{"question":"Με ποιες από τις παρακάτω εταιρείες έχει συνεργασθεί το ΙΝΝ του ΕΚΕΦΕ Δημόκριτος;",\
"a1":"1. IBM-Intel-BIC-British Airways",\
"a2":"2. Apple-Goody’s-Mc Donald’s-KFC ",\
"a3": "3. Zara-Gucci-Loreal-Levi’s",\
"a4":"4. Porsche-BMW-Mercedes-Siemens",\
"true":"1. IBM-Intel-BIC-British Airways",\
"img":"media/img/empty.png"}\
]';
return q;
}

function previous() {
var q = JSON.parse(getQ());
$("#reset30sec").click();
if (qidx > 0) {
var link = document.getElementById('title');
link.style.display = 'none';
qidx--;
}
var count = Object.keys(q[qidx]).length;
var str = "<h2>" + q[qidx]['question'] + "</h2>";
for (var i = 1; i < count - 1; i++) {
str += "<h3>" + q[qidx][Object.keys(q[qidx])[i]] + "</h3>";
}
var count = Object.keys(q[qidx]).length;
var answers = 1;
var color = '#000066blue';
if (qidx % 2 == 0) {
    color = '#ff9900';
}
var str = "<div style=\"justify-content:center;margin:auto;color:"+color+"\"><h2>" + q[qidx]['question'] + "</h2><table style=\"width:20%;margin:auto\";><tr>";
for (var i = 1; i < count; i++) {
    console.log(Object.keys(q[qidx])[i])
    if (Object.keys(q[qidx])[i] != 'img' && Object.keys(q[qidx])[i] != 'true'){
        if (answers % 2 == 0) {
            str += "<th><a class=\"btn btn-default wrapit\" href=\"#\" role=\"button\" id=\"ans"+answers+"\" style=\"width:400px;\" name=\"ans"+answers+"\" onclick=\"faultCheck(this); return false;\">" + q[qidx][Object.keys(q[qidx])[i]] + "</a></th></tr><tr>";
        } 
        else {
            str += "<th><a class=\"btn btn-default wrapit\" href=\"#\" role=\"button\" id=\"ans"+answers+"\" style=\"width:400px;\" name=\"ans"+answers+"\" onclick=\"faultCheck(this); return false;\">" + q[qidx][Object.keys(q[qidx])[i]] + "</a></th>";
        }
        answers++;
    }
}
str += '</table></div>';
if (q[qidx].hasOwnProperty('img')){
    str += '<img src="'+q[qidx]['img']+'"/>';
}
document.getElementById('quiz').innerHTML = str;
}

function next() {
var link = document.getElementById('title');
link.style.display = 'none';
var q = JSON.parse(getQ());
$("#reset30sec").click();
if (qidx < q.length - 1) {
qidx++;
}
var count = Object.keys(q[qidx]).length;
var answers = 1;
var color = 'blue';
if (qidx % 2 == 0) {
    color = '#ff9900';
}
var str = "<div style=\"justify-content:center;margin:auto;color:"+color+"\"><h2>" + q[qidx]['question'] + "</h2><table style=\"width:20%;margin:auto\";><tr>";
for (var i = 1; i < count; i++) {
    if (Object.keys(q[qidx])[i] != 'img' && Object.keys(q[qidx])[i] != 'true'){
        if (answers % 2 == 0) {
            str += "<th><a class=\"btn btn-default wrapit\" href=\"#\" role=\"button\" id=\"ans"+answers+"\" style=\"width:400px;\" name=\"ans"+answers+"\" onclick=\"faultCheck(this); return false;\">" + q[qidx][Object.keys(q[qidx])[i]] + "</a></th></tr><tr>";
        } 
        else {
            str += "<th><a class=\"btn btn-default wrapit\" href=\"#\" role=\"button\" id=\"ans"+answers+"\" style=\"width:400px;\" name=\"ans"+answers+"\" onclick=\"faultCheck(this); return false;\">" + q[qidx][Object.keys(q[qidx])[i]] + "</a></th>";
        }
        answers++;
    }
}
str += '</table></div>';
if (q[qidx].hasOwnProperty('img')) {
    str += '<img src="'+q[qidx]['img']+'"/>';
}
document.getElementById('quiz').innerHTML = str;
}

function qreset() {
var link = document.getElementById('title');
link.style.display = 'block';
document.getElementById('quiz').innerHTML = "";
$("#reset30sec").click();
qidx = -1;
}

function faultCheck(obj) {
var q = JSON.parse(getQ());
if (obj.innerHTML == q[qidx]['true']) {
obj.style.backgroundColor = '#00ff00';
}
else {
obj.style.backgroundColor = 'red';
}
}
